programming/misc/standard.html
---
title: "Standard"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Standard</title>
<!-- 2017-03-28 Tue 12:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>





</head>
<body>
<div id="content">
<h1 class="title">Standard</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 字符集</a></li>
<li><a href="#sec-2">2. POSIX</a></li>
<li><a href="#sec-3">3. JSON</a>
<ul>
<li><a href="#sec-3-1">3.1. 历史</a></li>
<li><a href="#sec-3-2">3.2. 语法</a></li>
</ul>
</li>
<li><a href="#sec-4">4. JSONP</a></li>
<li><a href="#sec-5">5. MessagePack</a></li>
<li><a href="#sec-6">6. YAML</a></li>
<li><a href="#sec-7">7. PB</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 字符集</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">字节数</th>
<th scope="col" class="left">格式</th>
<th scope="col" class="left">字符</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">ASCII</td>
<td class="left">1</td>
<td class="left"><code>0XXXXXXX</code> 第一位为 <code>0</code></td>
<td class="left">128 个字符（包括 32 个不可打印字符）</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">非 ASCII 单字节编码</td>
<td class="left">1</td>
<td class="left"><code>0XXXXXXX</code> 第一位为 <code>0</code></td>
<td class="left">ASCII 字符</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><code>1XXXXXXX</code> 第一位为 <code>1</code></td>
<td class="left">各语言的特殊字符（不同语言编码方式不同）</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">UTF-8</td>
<td class="left">1 ~ 4</td>
<td class="left"><code>0XXXXXXX</code></td>
<td class="left"><code>0000 0000 - 0000 007F</code> （同 ASCII 字符）</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><code>110XXXXX 10XXXXXX</code></td>
<td class="left"><code>0000 0080 - 0000 07FF</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><code>1110XXXX 10XXXXXX 10XXXXXX</code></td>
<td class="left"><code>0000 0800 - 0000 FFFF</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left"><code>11110XXX 10XXXXXX 10XXXXXX 10XXXXXX</code></td>
<td class="left"><code>0001 0000 - 0010 FFFF</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">GB2312</td>
<td class="left">2</td>
<td class="left">&#xa0;</td>
<td class="left">65536 个字符</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">UCS-2</td>
<td class="left">2</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Base64</td>
<td class="left">6 bit</td>
<td class="left">&#xa0;</td>
<td class="left">64 个可打印字符</td>
</tr>
</tbody>
</table>

<dl class="org-dl">
<dt> Unicode </dt><dd>设计用于收录世界上所有符号的编码方式，解决写入和解读方式不同造成的乱码问题。
<ul class="org-ul">
<li>只规定了每个符号的二进制代码，而没有规定如何存储（如字节长度），可以有多种实现方式。
</li>
</ul>
</dd>

<dt> UTF-8 </dt><dd>使用最广的 Unicode 实现方式。
<ul class="org-ul">
<li>一种变长的编码方式，根据不同的符号而变化字节长度。
</li>
<li>N 字节字符：第一个字节前 N 位为 <code>1</code> ，第 N+1 位为 <code>0</code> ，后面的字节前两位为 <code>10</code> 。
</li>
</ul>
</dd>

<dt> Unicode 转 UTF-8 </dt><dd>根据 Unicode 编码，判断字节长度。
<ul class="org-ul">
<li>从最低位起，将二进制编码填充进 UTF-8 的可用位置（ <code>X</code> ）。
</li>
</ul>
</dd>
</dl>


<dl class="org-dl">
<dt> UCS-2 </dt><dd>Unicode 的一种实现方式。
<ul class="org-ul">
<li>编码的高字节在前时为 big endian，低字节在前时为 little endian。
</li>
</ul>
</dd>
</dl>


<dl class="org-dl">
<dt> Base64 </dt><dd>用于在通常处理文本数据的场合，表示、传输、存储二进制数据。
</dd>
</dl>

<hr  />

<dl class="org-dl">
<dt> ANSI </dt><dd>英文文件使用 ASCII
<ul class="org-ul">
<li>简体中文使用 GB2312
</li>
<li>繁体中文使用 BIG5
</li>
</ul>
</dd>

<dt> Windows 下判断编码的方式 </dt><dd>FF FE 开头，UCS-2 big endian 编码
<ul class="org-ul">
<li>FE FF 开头，UCS-2 little endian 编码
</li>
<li>EF BB BF 开头，UTF-8 编码
</li>
<li>默认为 ANSI 编码
</li>
</ul>
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> POSIX</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> POSIX 系统 </dt><dd>Unix、Linux、Mac OS X、BSD 等。
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> JSON</h2>
<div class="outline-text-2" id="text-3">
<p>
JSON (JavaScript Object Notation) 是一种轻量级的数据交换格式，常用于 Ajax。JSON 比 XML 简单，在浏览器中处理的速度更快，适合表现对象图（object graph）。
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 历史</h3>
<div class="outline-text-3" id="text-3-1">
<p>
21 世纪初，Douglas Crockford 寻找一种简便的数据交换格式，能够在服务器之间交换数据。当时通用的数据交换语言是 XML，但是 Douglas Crockford 觉得 XML 的生成和解析都太麻烦，所以他提出了一种简化格式，也就是 JSON。
</p>

<p>
JSON 的规格非常简单，只用几百个字就能说清楚，而且 Douglas Crockford 声称这个规格永远不必升级，因为该规定的都规定了。
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 语法</h3>
<div class="outline-text-3" id="text-3-2">
<p>
JSON 语法是 JavaScript 对象表示语法的子集。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">并列数据的分隔</th>
<th scope="col" class="left"><code>,</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">并列数据集合（数组）</td>
<td class="left"><code>[]</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">映射</td>
<td class="left"><code>:</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">映射集合（对象）</td>
<td class="left"><code>{}</code></td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<label class="org-src-name">示例</label>
<pre class="src src-js">{
    <span class="org-string">"name"</span>: <span class="org-type">int</span>,
    <span class="org-string">"name"</span>: <span class="org-string">"string"</span>,
    <span class="org-string">"name"</span>: <span class="org-constant">true</span>,
    <span class="org-string">"name"</span>: [array],
    <span class="org-string">"name"</span>: {object},
    <span class="org-string">"name"</span>: <span class="org-constant">null</span>,
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> JSONP</h2>
<div class="outline-text-2" id="text-4">
<p>
JSONP (JSON with Padding) 是一种大多数浏览器支持的标准跨域数据访问方式。根据同源策略，一个域的网页不能同其他域的服务器通信。但 <code>&lt;script&gt;</code> 元素的跨域特性，允许网页获取其他来源动态产生的 JSON 数据，这个模式就是 JSONP。
</p>

<p>
JSONP 返回的不是 JSON，而是 JavaScript 调用，用 JavaScript 直译器执行而不是用 JSON 解析器解析。
</p>

<p>
JSONP 可以通过 JavaScript callback 的形式实现调用。客户端在调用 JSONP 服务时，URL 参数中包含一个 callback 函数名。
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> MessagePack</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>序列化库，性能和占用空间优于 JSON。
</li>
<li>序列化结果为二进制格式。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> YAML</h2>
<div class="outline-text-2" id="text-6">
<p>
YAML 是专用于配置文件的语言。
</p>

<p>
<a href="http://www.ruanyifeng.com/blog/2016/07/yaml.html">YAML 语言教程</a>
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> PB</h2>
<div class="outline-text-2" id="text-7">
<dl class="org-dl">
<dt> PB (Protocol Buffer) </dt><dd>Google 开发的数据交换格式，独立于语言、平台。
<ul class="org-ul">
<li>采用二进制格式，比使用 XML 进行数据交换快。
</li>
<li>可用于分布式应用之间的数据通信，或者异构网络环境下的数据交换。
</li>
<li>可用于网络传输、配置文件、数据存储等诸多领域。
</li>
</ul>
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-28 Tue 12:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
